In [2]:
import numpy as np
import pandas as pd

In [3]:
#apply fonkssiyonuda data frame in üzerinde dolaşmamızı sağlar

In [5]:
df1=pd.DataFrame({"grup":["a","b","a","b"],
                "var1":[10,20,30,40],
                "var2":[50,60,70,80,]})
df1

  grup  var1  var2
0    a    10    50
1    b    20    60
2    a    30    70
3    b    40    80

In [6]:
df2=pd.DataFrame({"var1":[10,20,30,40],
                "var2":[50,60,70,80,]})
df2

   var1  var2
0    10    50
1    20    60
2    30    70
3    40    80

In [8]:
df2.apply(np.sum)

var1    100
var2    260
dtype: int64

In [10]:
df2.apply(np.mean)

var1    25.0
var2    65.0
dtype: float64

In [11]:
df2.apply(max)

var1    40
var2    80
dtype: int64

In [13]:
df1.groupby("grup").apply(np.sum)

     grup  var1  var2
grup
a      aa    40   120
b      bb    60   140

In [14]:
df1.groupby("grup").apply(max)

     grup  var1  var2
grup
a       a    30    70
b       b    40    80

In [15]:
df1.apply(np.sum)

grup    abab
var1     100
var2     260
dtype: object